
#### Terraform Plan 📖
* **Proyecto (Workspace):** `tech-talk-demo8684`
* **Fichero de definición:** `project-definitions/demo-tech-talk.tfvars`
```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_iam_workload_identity_pool.github_pool[0] will be created
  + resource "google_iam_workload_identity_pool" "github_pool" {
      + display_name              = "GitHub Actions Identity Pool"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = (known after apply)
      + state                     = (known after apply)
      + workload_identity_pool_id = "github-pool"
    }

  # google_iam_workload_identity_pool_provider.github_provider[0] will be created
  + resource "google_iam_workload_identity_pool_provider" "github_provider" {
      + attribute_condition                = "attribute.repository == 'demo-project-factory/tech-talk-demo2'"
      + attribute_mapping                  = {
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + display_name                       = "GitHub Actions Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = (known after apply)
      + state                              = (known after apply)
      + workload_identity_pool_id          = "github-pool"
      + workload_identity_pool_provider_id = "github-provider"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # google_project_iam_binding.project_iam["roles/viewer"] will be created
  + resource "google_project_iam_binding" "project_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "user:raul.makendengue@devoteam.com",
        ]
      + project = (known after apply)
      + role    = "roles/viewer"
    }

  # google_project_iam_member.sa_predefined_roles["roles/resourcemanager.projectIamAdmin"] will be created
  + resource "google_project_iam_member" "sa_predefined_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/resourcemanager.projectIamAdmin"
    }

  # google_service_account.cicd_runner_sa[0] will be created
  + resource "google_service_account" "cicd_runner_sa" {
      + account_id   = "cicd-runner-sa"
      + disabled     = false
      + display_name = "CI/CD Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.sa_workload_identity_user[0] will be created
  + resource "google_service_account_iam_member" "sa_workload_identity_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # google_storage_bucket.tfstate_backend[0] will be created
  + resource "google_storage_bucket" "tfstate_backend" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.project_factory.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "0167D6-74B9B3-B50113"
      + deletion_policy     = "PREVENT"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
      + folder_id           = "766069960998"
      + id                  = (known after apply)
      + name                = "tech-talk-demo8684"
      + number              = (known after apply)
      + project_id          = (known after apply)
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.project_factory.module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DISABLE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.project_factory.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id                   = "project-service-account"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "tech-talk-demo8684 Project Service Account"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = (known after apply)
      + unique_id                    = (known after apply)
    }

  # module.project_factory.module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "artifactregistry.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "cloudbuild.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "container.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iam.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["run.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "run.googleapis.com"
    }

  # module.project_factory.module.project-factory.module.project_services.google_project_service.project_services["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "serviceusage.googleapis.com"
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cicd_service_account_email      = (known after apply)
  + cicd_tfstate_backend_bucket     = (known after apply)
  + cicd_workload_identity_provider = (known after apply)
  + project_id                      = (known after apply)
  + project_number                  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
**Acción Requerida:** Un revisor debe [aprobar el despliegue](https://github.com/demo-project-factory/tech-talk-demo/actions/runs/18967735062) para continuar con el `apply`.
